if um.lang ~= 'hi' then return end

Lang = {}

Lang.UI = {
    main = {
        spawn = 'प्रकट करें',
        last = {
            first = 'अंतिम',
            second = 'स्थान',
            words = 'याद रखें, आप जहाँ पैदा हुए हैं वह मायने नहीं रखता, महत्वपूर्ण बात यह है कि सफल होना।'
        },
        my = 'मेरा',
        back = 'वापस'
    },
    menu = {
        map = 'नक्शा',
        apart = {
            title = 'अपार्टमेंट',
            desc = 'यहाँ आप अपार्टमेंट देख सकते हैं और प्रबंधित कर सकते हैं'
        },
        house = {
            title = 'घर',
            desc = 'यहाँ आप अपने घर देख सकते हैं और प्रबंधित कर सकते हैं'
        },
        bookmarks = {
            title = 'पसंदीदा',
            desc = 'यहाँ आप अपने सहेजे गए स्थानों को देख सकते हैं और प्रबंधित कर सकते हैं'
        },
        cinematic = 'सिनेमाई'
    },
    rent = {
        title = 'अपार्टमेंट्स चुनें',
        button = 'एक अपार्टमेंट कमरा किराए पर लें'
    },
}

Lang.Bookmark = {
    input = {
        title = 'स्थान जोड़ें',
        first = {
            name = 'स्थान का नाम',
            desc = 'अपने विशेष स्थान का नाम दें'
        },
        second = {
            name = 'स्थान छवि (URL)',
            desc = 'यहाँ एक चित्र लिंक डालें | केवल (discord या imgur)'
        },
    },
    dialog = {
        header = 'बुकमार्क्स का भुगतान',
        content = 'क्या आप इस स्थान को अपने बुकमार्क्स में जोड़ने के लिए %s$ का भुगतान करने के लिए सहमत हैं?'
    },
    error = {
        title = 'बुकमार्क्स',
        link = 'केवल डिस्कॉर्ड या इमगुर लिंक',
        money = 'आपके पास पर्याप्त पैसे नहीं हैं'
    }
}