Config = {}

Config.framework = "qbcore"   -- esx or qbcore

Config.ESX = 'es_extended'

Config.QB = 'qb-core'

Config.Mysql = "oxmysql" -- oxmysql, mysql-async or ghmattisql

Config.job = {
    needjob = true,
    jobname = 'trucker'
}

Config.BattlePass = {
    Active = false,
    xp = 1000
}

Config.Target = {UseTarget = false, TargetExport = 'qb-target', Coords = vector3(-780.44, -2636.88,13.8), Text = 'START JOB', Icon = 'fa fa-truck'}

Config.UseFuel = false

Config.UseKeys = false

Config.UseDeleteVehicle = false

Config.NPCHOME = {{x = -780.44, y = -2636.88, z = 13.8, h = 146.76}}

Config.NPCS = {
    ['home'] = {
        model = 'cs_floyd', --npc model (https://docs.fivem.net/docs/game-references/ped-models/)
        anim = 'WORLD_HUMAN_CLIPBOARD' --npc animation (https://wiki.rage.mp/index.php?title=Scenarios)
    }

}

Config.Truck = {
    [1] = "phantom",
    [2] = "hauler2",
    [3] = "packer",
    [4] = "phantom3",
}

Config.Transport = {
    ['legal'] = {
        createtruck = vector3(-744.36, -2544.12, 14.04),
        gocoords = vector3(-773.36, -2637.16, 13.4),
        gocoordsnpc = vector3(-773.88, -2612.32, 13.92),
        createTrailers = vector3(-794.52, -2673.24, 13.8),
        trailer = 'trailers2',
        key1 = 38,
        key2 = 47
    },

    ['ilegal'] = {
        createtruck = vector3(-744.36, -2544.12, 14.04),
        gocoords = vector3(-773.36, -2637.16, 13.4),
        gocoordsnpc = vector3(-773.88, -2612.32, 13.92),
        Probabilityenemies = 10,
        Probabilitycallpolice = 10,
        enemiesvehicle = 'sanchez',
        enemiesweapon = 'WEAPON_PISTOL',
        trailer = 'trailers2',
        typemoney = 'crypto'  -- only use QB
    }

}

Config.RoboCargamento = {
    ['Peds'] = {
        [1]={x = 1678.12, y = -2033.08, z = 99.8,h = 130.4, ped},
        [2]={x = 1679.36, y = -2021.88, z = 101.04, h = 130.4, ped},
        [3]={x = 1684.36, y = -2015.92, z = 101.84, h = 130.4,  ped}, 
    }         
}

Config.locationstrailerlegal = {
    [1] = {x = -749.2855, y = -2050.6199, z = 8.9321}, 
    [2] = {x = -973.8290, y = -1480.6259, z = 4.0131}, 
    [3] = {x = -1267.4697, y = -1358.4609, z = 3.2264}, 
    [4] = {x = -830.5305, y = -1265.2061, z = 4.0004}, 
    [5] = {x = -735.6794, y = -1295.6349, z = 4.0004}, 
    [6] = {x = -692.7869, y = -1410.2706, z = 4.0005}, 
    [7] = {x = -743.7684, y = -1420.9418, z = 4.0005}, 
    [8] = {x = -736.9767, y = -1441.4833, z = 4.0005}, 
    [9] = {x = -730.7818, y = -1464.7627, z = 4.0005}, 
    [10] = {x = -710.9760, y = -1469.1658, z = 4.0005}, 
    [11] = {x = -726.9841, y = -1491.7729, z = 4.0005},  
    [12] = {x = -738.6957, y = -1496.8461, z = 4.0005},  
    [13] = {x = -755.0344, y = -1472.3568, z = 4.0005},  
    [14] = {x = -755.9527, y = -1457.3701, z = 4.0005}, 
    [15] = {x = -647.7246, y = -1635.6130, z = 23.9898}, 
    [16] = {x = -593.4661, y = -1801.0840, z = 22.2215},  
    [17] = {x = -483.6124, y = -2157.1621, z = 8.2992}, 
    [18] = {x = -553.9661, y = -2126.0117, z = 4.9890}, 
    [19] = {x = -580.3616, y = -2102.1169, z = 4.9921}, 
    [20] = {x = -596.6238, y = -2128.4443, z = 4.9921}, 
    [21] = {x = -639.5411, y = -2127.5823, z = 4.9923}, 
    [22] = {x = -600.6189, y = -2317.9802, z = 12.8282}, 
    [23] = {x = -590.9404, y = -2326.0364, z = 12.8282}, 
    [24] = {x = -582.6838, y = -2334.5913, z = 12.8282}, 
    [25] = {x = -803.8523, y = -2386.2900, z = 13.5707}, 
    [26] = {x = -801.7496, y = -2414.4915, z = 13.5707}, 
    [27] = {x = -804.0616, y = -2435.5403, z = 13.5707},  
    [28] = {x = -1001.5916, y = -2379.4050, z = 12.9313}, 
    [29] = {x = -1022.2595, y = -2385.0320, z = 12.9445}, 
    [30] = {x = -1035.5435, y = -2404.1323, z = 12.9445}, 
    [31] = {x = -1056.4019, y = -2439.2788, z = 12.9445}, 
    [32] = {x = -1078.0571, y = -2458.4294, z = 12.9445}, 
    [33] = {x = -1131.6843, y = -2424.8389, z = 12.9452}, 
    [34] = {x = -1122.6478, y = -2389.5159, z = 12.9452}, 
    [35] = {x = -1111.6304, y = -2367.0920, z = 12.9452}, 
    [36] = {x = -1106.3589, y = -2339.7778, z = 12.9446}, 
    [37] = {x = -1097.7692, y = -2315.4084, z = 12.9446}, 
    [38] = {x = -1121.4926, y = -2287.9995, z = 12.9446}, 
    [39] = {x = -1142.1322, y = -2275.4124, z = 12.9446}, 
    [40] = {x = -1163.4934, y = -2263.4045, z = 12.9446}, 
    [41] = {x = -1183.7681, y = -2251.5337, z = 12.9446}, 
    [42] = {x = -1203.9178, y = -2246.2847, z = 12.9445}, 
    [43] = {x = -1209.4049, y = -2270.3782, z = 12.9445}, 
    [44] = {x = -1219.9824, y = -2301.0867, z = 12.9445}, 
    [45] = {x = -1206.3982, y = -2330.1846, z = 12.9446}, 
    [46] = {x = -1297.6775, y = -2299.8774, z = 12.9457}, 
    [47] = {x = -1281.9164, y = -2273.9160, z = 12.9458}, 
    [48] = {x = -1269.1676, y = -2253.1816, z = 12.9459}, 
    [49] = {x = -1250.4816, y = -2224.3904, z = 12.9446}, 
    [50] = {x = -1256.7753, y = -2178.6777, z = 12.9446}, 
    [51] = {x = -1289.3136, y = -2170.2703, z = 12.9446}, 
    [52] = {x = -972.9365, y = -2267.2666, z = 7.9899}, 
    [53] = {x = -1013.8275, y = -2265.8948, z = 8.0111}, 
    [54] = {x = -1016.9517, y = -2230.0667, z = 7.9968},  
    [55] = {x = -1159.0187, y = -2191.5361, z = 12.1957}, 
    [56] = {x = -1159.7051, y = -2185.1189, z = 12.1956}, 
    [57] = {x = -1131.8527, y = -1978.5313, z = 12.1632}, 
    [58] = {x = -1060.6505, y = -2021.9401, z = 12.1616}, 
    [59] = {x = -1071.6586, y = -2055.8635, z = 12.1793}, 
    [60] = {x = -989.4048, y = -2084.1880, z = 9.8343}, 
    [61] = {x = -925.8274, y = -2074.0991, z = 8.2990}, 
    [62] = {x = -942.2563, y = -2239.6338, z = 7.8590}, 
    [63] = {x = -921.6920, y = -2218.7710, z = 6.2326}, 
    [64] = {x = -922.7568, y = -2291.9985, z = 5.7065}, 
    [65] = {x = -911.7251, y = -2311.3301, z = 5.7090}, 
    [66] = {x = -792.0627, y = -2370.7363, z = 13.5693}, 
    [67] = {x = -488.1729, y = -2155.9573, z = 8.2448}, 
    [68] = {x = 139.3647, y = -2541.9858, z = 4.9977}, 
    [69] = {x = 90.8837, y = -2544.1177, z = 5.0000}, 
    [70] = {x = 7.5045, y = -2499.5671, z = 5.0067}, 
    [71] = {x = 41.0626, y = -2481.0740, z = 5.0068}, 
    [72] = {x = 9.5583, y = -2431.7654, z = 4.9404}, 
    [73] = {x = -25.6588, y = -2419.6555, z = 4.9992}, 
    [74] = {x = -38.1488, y = -2450.9460, z = 5.0050}, 
    [75] = {x = -65.1711, y = -2486.4761, z = 5.0403}, 
    [76] = {x = -91.7806, y = -2521.4221, z = 5.0023}, 
    [77] = {x = -245.7328, y = -2389.9136, z = 5.0009}, 
    [78] = {x = -274.5187, y = -2462.9375, z = 5.0006}, 
    [79] = {x = -252.5560, y = -2528.5637, z = 5.0005}, 
    [80] = {x = -235.7257, y = -2498.4268, z = 4.9984}, 
    [81] = {x = -299.7665, y = -2565.7468, z = 5.0001}, 
    [82] = {x = -325.2944, y = -2541.2427, z = 5.0006}, 
    [83] = {x = -343.4971, y = -2518.2351, z = 5.0006}, 
    [84] = {x = -371.6169, y = -2496.9646, z = 5.0008}, 
    [85] = {x = -399.5993, y = -2477.9297, z = 5.0008}, 
    [86] = {x = 224.2429, y = -2889.0520, z = 5.0118}, 
    [87] = {x = 611.2904, y = -2713.0896, z = 5.0772}, 
    [88] = {x = 631.3633, y = -2935.6294, z = 5.0382}, 
    [89] = {x = 1130.8655, y = -2387.2537, z = 30.4965}, 
    [90] = {x = 1245.2782, y = -2399.5818, z = 47.8395}, 
    [91] = {x = 1270.5574, y = -2311.52958, z = 49.4403}, 
    [92] = {x = 1295.4813, y = -2259.6030, z = 49.7556}, 
    [93] = {x = 1263.9117, y = -2586.5132, z = 42.8265}, 
    [94] = {x = 1608.3812, y = -2455.1289, z = 82.5207}, 
    [95] = {x = 1695.9645, y = -1464.5045, z = 111.8913},
    [96] = {x = 2568.3259, y = 430.2322, z = 107.4555}, 
    
}

Config.locationstrailerilegal = {
    [1] = {x = -749.2855, y = -2050.6199, z = 8.9321}, 
    [2] = {x = -973.8290, y = -1480.6259, z = 4.0131}, 
    [3] = {x = -1267.4697, y = -1358.4609, z = 3.2264}, 
    [4] = {x = -830.5305, y = -1265.2061, z = 4.0004}, 
    [5] = {x = -735.6794, y = -1295.6349, z = 4.0004}, 
    [6] = {x = -692.7869, y = -1410.2706, z = 4.0005}, 
    [7] = {x = -743.7684, y = -1420.9418, z = 4.0005}, 
    [8] = {x = -736.9767, y = -1441.4833, z = 4.0005}, 
    [9] = {x = -730.7818, y = -1464.7627, z = 4.0005}, 
    [10] = {x = -710.9760, y = -1469.1658, z = 4.0005}, 
    [11] = {x = -726.9841, y = -1491.7729, z = 4.0005},  
    [12] = {x = -738.6957, y = -1496.8461, z = 4.0005},  
    [13] = {x = -755.0344, y = -1472.3568, z = 4.0005},  
    [14] = {x = -755.9527, y = -1457.3701, z = 4.0005}, 
    [15] = {x = -647.7246, y = -1635.6130, z = 23.9898}, 
    [16] = {x = -593.4661, y = -1801.0840, z = 22.2215},  
    [17] = {x = -483.6124, y = -2157.1621, z = 8.2992}, 
    [18] = {x = -553.9661, y = -2126.0117, z = 4.9890}, 
    [19] = {x = -580.3616, y = -2102.1169, z = 4.9921}, 
    [20] = {x = -596.6238, y = -2128.4443, z = 4.9921}, 
    [21] = {x = -639.5411, y = -2127.5823, z = 4.9923}, 
    [22] = {x = -600.6189, y = -2317.9802, z = 12.8282}, 
    [23] = {x = -590.9404, y = -2326.0364, z = 12.8282}, 
    [24] = {x = -582.6838, y = -2334.5913, z = 12.8282}, 
    [25] = {x = -803.8523, y = -2386.2900, z = 13.5707}, 
    [26] = {x = -801.7496, y = -2414.4915, z = 13.5707}, 
    [27] = {x = -804.0616, y = -2435.5403, z = 13.5707},  
    [28] = {x = -1001.5916, y = -2379.4050, z = 12.9313}, 
    [29] = {x = -1022.2595, y = -2385.0320, z = 12.9445}, 
    [30] = {x = -1035.5435, y = -2404.1323, z = 12.9445}, 
    [31] = {x = -1056.4019, y = -2439.2788, z = 12.9445}, 
    [32] = {x = -1078.0571, y = -2458.4294, z = 12.9445}, 
    [33] = {x = -1131.6843, y = -2424.8389, z = 12.9452}, 
    [34] = {x = -1122.6478, y = -2389.5159, z = 12.9452}, 
    [35] = {x = -1111.6304, y = -2367.0920, z = 12.9452}, 
    [36] = {x = -1106.3589, y = -2339.7778, z = 12.9446}, 
    [37] = {x = -1097.7692, y = -2315.4084, z = 12.9446}, 
    [38] = {x = -1121.4926, y = -2287.9995, z = 12.9446}, 
    [39] = {x = -1142.1322, y = -2275.4124, z = 12.9446}, 
    [40] = {x = -1163.4934, y = -2263.4045, z = 12.9446}, 
    [41] = {x = -1183.7681, y = -2251.5337, z = 12.9446}, 
    [42] = {x = -1203.9178, y = -2246.2847, z = 12.9445}, 
    [43] = {x = -1209.4049, y = -2270.3782, z = 12.9445}, 
    [44] = {x = -1219.9824, y = -2301.0867, z = 12.9445}, 
    [45] = {x = -1206.3982, y = -2330.1846, z = 12.9446}, 
    [46] = {x = -1297.6775, y = -2299.8774, z = 12.9457}, 
    [47] = {x = -1281.9164, y = -2273.9160, z = 12.9458}, 
    [48] = {x = -1269.1676, y = -2253.1816, z = 12.9459}, 
    [49] = {x = -1250.4816, y = -2224.3904, z = 12.9446}, 
    [50] = {x = -1256.7753, y = -2178.6777, z = 12.9446}, 
    [51] = {x = -1289.3136, y = -2170.2703, z = 12.9446}, 
    [52] = {x = -972.9365, y = -2267.2666, z = 7.9899}, 
    [53] = {x = -1013.8275, y = -2265.8948, z = 8.0111}, 
    [54] = {x = -1016.9517, y = -2230.0667, z = 7.9968},  
    [55] = {x = -1159.0187, y = -2191.5361, z = 12.1957}, 
    [56] = {x = -1159.7051, y = -2185.1189, z = 12.1956}, 
    [57] = {x = -1131.8527, y = -1978.5313, z = 12.1632}, 
    [58] = {x = -1060.6505, y = -2021.9401, z = 12.1616}, 
    [59] = {x = -1071.6586, y = -2055.8635, z = 12.1793}, 
    [60] = {x = -989.4048, y = -2084.1880, z = 9.8343}, 
    [61] = {x = -925.8274, y = -2074.0991, z = 8.2990}, 
    [62] = {x = -942.2563, y = -2239.6338, z = 7.8590}, 
    [63] = {x = -921.6920, y = -2218.7710, z = 6.2326}, 
    [64] = {x = -922.7568, y = -2291.9985, z = 5.7065}, 
    [65] = {x = -911.7251, y = -2311.3301, z = 5.7090}, 
    [66] = {x = -792.0627, y = -2370.7363, z = 13.5693}, 
    [67] = {x = -488.1729, y = -2155.9573, z = 8.2448}, 
    [68] = {x = 139.3647, y = -2541.9858, z = 4.9977}, 
    [69] = {x = 90.8837, y = -2544.1177, z = 5.0000}, 
    [70] = {x = 7.5045, y = -2499.5671, z = 5.0067}, 
    [71] = {x = 41.0626, y = -2481.0740, z = 5.0068}, 
    [72] = {x = 9.5583, y = -2431.7654, z = 4.9404}, 
    [73] = {x = -25.6588, y = -2419.6555, z = 4.9992}, 
    [74] = {x = -38.1488, y = -2450.9460, z = 5.0050}, 
    [75] = {x = -65.1711, y = -2486.4761, z = 5.0403}, 
    [76] = {x = -91.7806, y = -2521.4221, z = 5.0023}, 
    [77] = {x = -245.7328, y = -2389.9136, z = 5.0009}, 
    [78] = {x = -274.5187, y = -2462.9375, z = 5.0006}, 
    [79] = {x = -252.5560, y = -2528.5637, z = 5.0005}, 
    [80] = {x = -235.7257, y = -2498.4268, z = 4.9984}, 
    [81] = {x = -299.7665, y = -2565.7468, z = 5.0001}, 
    [82] = {x = -325.2944, y = -2541.2427, z = 5.0006}, 
    [83] = {x = -343.4971, y = -2518.2351, z = 5.0006}, 
    [84] = {x = -371.6169, y = -2496.9646, z = 5.0008}, 
    [85] = {x = -399.5993, y = -2477.9297, z = 5.0008}, 
    [86] = {x = 224.2429, y = -2889.0520, z = 5.0118}, 
    [87] = {x = 611.2904, y = -2713.0896, z = 5.0772}, 
    [88] = {x = 631.3633, y = -2935.6294, z = 5.0382}, 
    [89] = {x = 1130.8655, y = -2387.2537, z = 30.4965}, 
    [90] = {x = 1245.2782, y = -2399.5818, z = 47.8395}, 
    [91] = {x = 1270.5574, y = -2311.52958, z = 49.4403}, 
    [92] = {x = 1295.4813, y = -2259.6030, z = 49.7556}, 
    [93] = {x = 1263.9117, y = -2586.5132, z = 42.8265}, 
    [94] = {x = 1608.3812, y = -2455.1289, z = 82.5207}, 
    [95] = {x = 1695.9645, y = -1464.5045, z = 111.8913},
    [96] = {x = 2568.3259, y = 430.2322, z = 107.4555}, 
    
}

Config.locationstransportlegal = {
    [1] = {x = -826.4, y = -2690.2, z = 13.88},
    [2] = {x = 1146.68, y = -3281.16, z = 5.92},
    [3] = {x = 844.6, y = -2350.92, z = 30.32, h = 284.88},
    [4] = {x = -806.4, y = -2679.64, z = 13.8},
    [5] = {x = -826.4, y = -2690.2, z = 13.88},
    [6] = {x = -806.4, y = -2679.64, z = 13.8},
    [7] = {x = -826.4, y = -2690.2, z = 13.88},
    [8] = {x = -806.4, y = -2679.64, z = 13.8},
    [9] = {x = -826.4, y = -2690.2, z = 13.88}
}

Config.locationstransportilegal = {
    [1] = {x = -826.4, y = -2690.2, z = 13.88},
    [2] = {x = 1146.68, y = -3281.16, z = 5.92},
    [3] = {x = 844.6, y = -2350.92, z = 30.32, h = 284.88}, 
    [4] = {x = -806.4, y = -2679.64, z = 13.8},
    [5] = {x = -826.4, y = -2690.2, z = 13.88},
    [6] = {x = -806.4, y = -2679.64, z = 13.8},
    [7] = {x = -826.4, y = -2690.2, z = 13.88},
    [8] = {x = -806.4, y = -2679.64, z = 13.8},
    [9] = {x = -826.4, y = -2690.2, z = 13.88}
}

Config.LegalPackagePoints = {

    totalpackage = 6,      -- if you add more packages, add the number of packages there are in total to pick up

    {x = 61.84, y = -2674.16, z = 5.0},
    {x = 60.08, y = -2674.16, z = 5.0},
    {x = 58.24, y = -2674.16, z = 5.0},
    {x = 58.32, y = -2675.76, z = 5.0},
    {x = 58.36, y = -2677.32, z = 5.0},
    {x = 58.4, y = -2679.08, z = 5.0}

}

Config.IlegalWeaponsPoints = {

    totalweapon = 6,       -- if you add more weapons, add the total number of weapons to collect

    {x = 1508.0, y = -2095.52, z = 75.84},
    {x = 1509.28, y = -2095.32, z = 75.84},
    {x = 1509.6, y = -2100.96, z = 75.68},
    {x = 1510.96, y = -2101.4, z = 75.68},
    {x = 1504.68, y = -2107.88, z = 75.36},
    {x = 1497.16, y = -2102.12, z = 75.52}

}


Config.Level = {
    ['legal'] = {
        [1] = {
            money = 100,        -- money that it will give you if you are at level 1
            exp = 10,           -- exp that it will give you if you are at level 1
            exprequired = 1000  -- exp required to level up (legal and ilegal)
        },
        [2] = {
            money = 200,
            exp = 20, 
            exprequired = 2000
        },
        [3] = {
            money = 300,
            exp = 30, 
            exprequired = 3000
        },
        [4] = {
            money = 400,
            exp = 40, 
            exprequired = 4000
        },
        [5] = {
            money = 500,
            exp = 50, 
            exprequired = 5000
        },
        [6] = {
            money = 600,
            exp = 60, 
            exprequired = 6000
        },
        [7] = {
            money = 700,
            exp = 70, 
            exprequired = 7000
        },
        [8] = {
            money = 800,
            exp = 80, 
            exprequired = 8000
        },
        [9] = {
            money = 900,
            exp = 90, 
            exprequired = 9000
        },
        [10] = {
            money = 1000,
            exp = 100, 
            exprequired = 100000 -- do not touch
        }
    },

    ['ilegal'] = {
        paywithitem = false,   -- will pay you with an item if it is set to "true".
        item = 'black_money',  -- item name.

        [1] = {
            money = 100,
            exp = 10, 
        },
        [2] = {
            money = 2000,
            exp = 20, 
        },
        [3] = {
            money = 3000,
            exp = 30, 
        },
        [4] = {
            money = 4000,
            exp = 40, 
        },
        [5] = {
            money = 5100,
            exp = 50, 
        },
        [6] = {
            money = 6100,
            exp = 60, 
        },
        [7] = {
            money = 7100,
            exp = 70, 
        },
        [8] = {
            money = 8100,
            exp = 80, 
        },
        [9] = {
            money = 9100,
            exp = 90, 
        },
        [10] = {
            money = 1100,
            exp = 100, 
        },
    }

}

Config.Translations = {

    ['language'] = "EN", --You can choose which language the notifications will be in. (EN, ES, FR)

    ['EN'] = {
        [1] = "Press ~b~E~w~ to open",
        [2] = "Go to the gps coordinates, and pick up the cargo.",
        [3] = "~r~[E]~s~ - pick up package",
        [4] = "This was the last box, load it and go to the new location to download.",
        [5] = "~g~[E]~s~ - Open Doors",
        [6] = "~g~[E]~s~ - Close Doors | ~g~[G]~s~ - Put package",
        [7] = "Packages: ~g~",
        [8] = "/6 ~s~",
        [9] = "You already have a job to do.",
        [10] = "You have been caught and the police have been called.",
        [11] = "They are making illegal loadings, we have marked on your gps the area where it was last seen.",
        [12] = "~r~[E]~s~ - collect weapons",
        [13] = "These were the last weapons, load them and go to the new location to unload it.",
        [14] = "Weapons: ~g~",
        [15] = "/6 ~s~",
        [16] = "A worker is on his way with the truck, wait for him to arrive.",
        [17] = "Now you have to go and pick up the goods, we have marked it on the gps.",
        [18] = "The gun owners have found out and are after you, kill them.",
        [19] = "You need to have a truck driver's job for this.",
        [20] = "~g~[E]~s~ - Deliver truck",
    },

    ['ES'] = {
        [1] = "Pulsa ~b~E~w~ para abrir",
        [2] = "Ve a las coordenadas gps, y recoge la carga",
        [3] = "~r~[E]~s~ - recoger el paquete",
        [4] = "Esta era la última caja, cárgala y ve a la nueva ubicación para descargarla",
        [5] = "~g~[E]~s~ - Abrir puertas",
        [6] = "~g~[E]~s~ - Cerrar Puertas | ~g~[G]~s~ - Poner paquete",
        [7] = "Paquetes: ~g~",
        [8] = "/6 ~s~",
        [9] = "Ya tienes un trabajo que hacer",
        [10] = "Te han pillado y han llamado a la policía",
        [11] = "Están haciendo cargas ilegales, hemos marcado en su gps la zona donde fue visto por última vez",
        [12] = "~r~[E]~s~ - recoger las armas",
        [13] = "Estas fueron las últimas armas, cárgalas y ve a la nueva ubicación para descargarlas",
        [14] = "Armas: ~g~",
        [15] = "/6 ~s~",
        [16] = "Un trabajador está en camino con el camión, espere a que llegue.",
        [17] = "Ahora tienes que ir a recoger la mercancía, la hemos marcado en el gps.",
        [18] = "Los propietarios de armas se han enterado y van a por ti, mátalos.",
        [19] = "Para esto hay que tener un trabajo de camionero.",
        [20] = "~g~[E]~s~ - Entregar Camión",
    },

    ['FR'] = {        
        [1] = "Appuyez sur ~b~E~w~ pour ouvrir",
        [2] = "Allez aux coordonnées gps, et prenez la cargaison",
        [3] = "~r~[E]~s~ - ramasse le paquet.",
        [4] = "C'était la dernière boîte, chargez-la et allez au nouvel emplacement pour la décharger",
        [5] = "~g~[E]~s~ - Ouvrir les portes.",
        [6] = "~g~[E]~s~ - Close Doors | ~g~[G]~s~ - Put Package",
        [7] = "Paquets : ~g~",
        [8] = "/6 ~s~",
        [9] = "Vous avez déjà un travail à faire",
        [10] = "Vous avez été pris et la police a été appelée.",
        [11] = "Ils font des accusations illégales, nous avons marqué sur votre GPS la zone où vous avez été vu pour la dernière fois",
        [12] = "~r~[E]~s~ - ramasse les armes.",
        [13] = "Ce sont les dernières armes, chargez-les et allez au nouvel emplacement pour les décharger",
        [14] = "Armes : ~g~",
        [15] = "/6 ~s~",
        [16] = "Un ouvrier est en route avec le camion, attendez qu'il arrive",
        [17] = "Maintenant vous devez aller chercher les marchandises, nous l'avons marqué sur le gps",
        [18] = "Les propriétaires d'armes à feu en ont entendu parler et sont après vous, tuez-les.",
        [19] = "Il faut avoir un métier de chauffeur routier pour cela.",
        [20] = "~g~[E]~s~ - Entregar Camión",
    },


}